# Importar Librerias 

Graficacion

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
salaries = pd.read_csv("./DATAsets/linkedin-jobs-usa.csv")

In [8]:
salaries.shape

(2845, 9)

In [10]:
# para saber los nulos
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

# tratamiento de duplicados

In [12]:
salaries.drop_duplicates()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [13]:
salaries_limpieza = salaries.copy()

In [14]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

In [17]:
salaries_limpieza.duplicated().sum()

np.int64(0)

In [19]:
salaries_limpieza[salaries_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [20]:
salaries_limpieza = salaries_limpieza.drop_duplicates

In [52]:
salaries_limpieza = salaries.copy()

In [51]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

# Tratamientos de valores nulos nan

## visualisar los valores nulos 

> valores nulos por columna

In [45]:
print(f"valores nan por columna {salaries_limpieza.isna().sum()} ")

valores nan por columna title               0
company             0
description         0
onsite_remote       0
salary           1916
location            0
criteria            0
posted_date         0
link                0
dtype: int64

In [48]:
# eliminar filas que tienen al menos un valor nulo 
#elimina toda la fila

df_sin_nulos = salaries.dropna()

In [49]:
# elimina columnas que contiene al menos un valor nulo

df_sin_nulos_columnas = salaries.dropna(axis=1)

In [53]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary           0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [55]:
df_sin_nulos.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...

In [59]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

## **Axis** 0 revisa por fila
## **Axis** 1 revisa por columna

## **how any** si por lo menos hay un Nan
## **how all** si todos llegan a ser Nan

In [ ]:
df_sin_nulos_columnas = salaries.dropna(axis=0,how='any')
df_sin_nulos_columnas = salaries.dropna(axis=0,how='all')
df_sin_nulos_columnas = salaries.dropna(axis=1,how='any')
df_sin_nulos_columnas = salaries.dropna(axis=1,how='any')

# Transformacion de datos

## 2da opcion: remplasar los nan por la media

### parsing (parseo) de la columna salary

In [61]:
## Este código toma una columna 'salary' que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
## El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
## Esto es útil cuando la columna 'salary' inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos.df_sin_nulos['salary_numeric'] = df_sin_nulos

df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

/tmp/ipykernel_10797/2892127591.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

In [64]:
df_sin_nulos['salary_numeric'].describe()

count       929.000000
mean      47949.630786
std       47330.459576
min          22.000000
25%          40.000000
50%       60000.000000
75%       85000.000000
max      130000.000000
Name: salary_numeric, dtype: float64